# Set global configuration arguments
cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"

###############################################################################
# CLI tools                                                                   #
###############################################################################

# Cask dependencies
brew "mas"

brew "awscli"
brew "cmus"
brew "ctags"
brew "duti"
brew "fzf"
brew "gh"
brew "htop"
brew "rg"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"

###############################################################################
# Cask GUI Applications                                                       #
###############################################################################

# Password Manager & Authenticator
cask "bitwarden"
cask "authy"

# Dev Tools
cask "CotEditor"
cask "visual-studio-code"
cask "ngrok"
cask "postman"
cask "docker"
cask "tunnelblick"

# DB
cask "psequel"
cask "sequel-pro"
cask "robo-3t"

# Browsers
cask "google-chrome"
cask "firefox"

# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "webpquicklook"
cask "quicklook-json"

# Communication
cask "slack"
cask "zoomus"

# Input Method
cask "google-japanese-ime"
# TODO: open /opt/homebrew/Caskroom/google-japanese-ime/latest/GoogleJapaneseInput.pkg
cask "mcbopomofo"
# TODO: open /opt/homebrew/Caskroom/mcbopomofo/2.4/McBopomofoInstaller.app

# Others
cask "obsidian"
cask "spotify"
cask "dropbox"
cask "sketch"

###############################################################################
# MAS Applications                                                            #
###############################################################################

# Apple
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# Other Purchased
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Quick Calendar", id: 1004514425
