# Set global configuration arguments
cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"

###############################################################################
# CLI tools                                                                   #
###############################################################################

# Cask dependencies
brew "mas"

brew "bash-completion"
brew "cmus"
brew "ctags"
brew "duti"
brew "fzf"
brew "the_silver_searcher"
brew "htop"
brew "git"
brew "tig"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "wget"

###############################################################################
# Cask GUI Applications                                                       #
###############################################################################

# Dev Tools
cask "anaconda"
cask "CotEditor"
cask "ngrok"
cask "postman"
cask "psequel"
cask "sequel-pro"
cask "mongodb-compass"

# Browsers
cask "google-chrome"
cask "firefox"

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "webpquicklook"
cask "quicklook-json"
cask "betterzip"

# Notes
cask "boostnote"
cask "typora"

# Communication
cask "slack"
cask "zoomus"

# Others
cask "soundflower"
cask "spotify"
cask "lyricsx"
cask "dropbox"
cask "sketch"

###############################################################################
# MAS Applications                                                            #
###############################################################################

# Apple
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# Other Purchased
mas "Magnet", id: 441258766
mas "LINE", id: 539883307
mas "Quick Calendar", id: 1004514425
mas "iTranslate", id: 884952790
