# Set global configuration arguments
cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"

###############################################################################
# CLI tools                                                                   #
###############################################################################

# Cask dependencies
brew "mas"

brew "awscli"
brew "ctags"
brew "duti"
brew "fzf"
brew "gh"
brew "htop"
brew "rg"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

brew "java"
brew "node"
brew "corepack"

###############################################################################
# Cask GUI Applications                                                       #
###############################################################################

# Password Manager & Authenticator
cask "bitwarden"
cask "authy"

# Dev Tools
cask "CotEditor"
cask "visual-studio-code"
cask "ngrok"
cask "postman"
cask "docker"

# DB
cask "sequel-pro"
cask "studio-3t"
cask "tableplus"

# Browsers
cask "google-chrome"
cask "firefox"

# Input Method
cask "google-japanese-ime"
cask "mcbopomofo"

# Others
cask "obsidian"
cask "spotify"
cask "dropbox"
cask "zoom"
cask "slack"

###############################################################################
# MAS Applications                                                            #
###############################################################################

mas "LINE", id: 539883307
mas "Magnet", id: 441258766
